{
  "slug": "pa-mi-gente",
  "title": "Pa Mi Gente - Groceries & Remittance Services",
  "mainImage": "/images/case-studies/casestudy-cards/pami-gente-casestudy.webp",
  "overview": "Pa Mi Gente is an innovative platform bridging families across borders by enabling US-based customers to send groceries and money to loved ones in Cuba. Evolving from a simple grocery delivery service into a full-featured remittance solution, the platform empowers customers to maintain family connections through reliable, secure services.",
  "definedGoals": [
    "Design an intuitive bilingual website to serve both English and Spanish speakers.",
    "Enable effortless browsing and ordering of groceries with real-time inventory visibility.",
    "Implement a secure, compliant money transfer system supporting USD, CUP, and MLC currencies.",
    "Provide dynamic currency conversion and flexible delivery options.",
    "Integrate secure payment gateways and maintain regulatory compliance.",
    "Create a seamless user experience optimized for both desktop and mobile devices."
  ],
  "workflow": [
    {
      "label": "#1: Challenge",
      "text": "Pa Mi Gente needed to handle complex remittance workflows, manage multiple currencies, and provide a bilingual experience without compromising ease of use. Ensuring secure payments, maintaining compliance, and integrating real-time exchange rates added to the project’s complexity."
    },
    {
      "label": "#2: Solution Design",
      "text": "We focused on a clean, accessible design with clear pathways for shopping and sending money. The UI was built to support bilingual content and currency-specific workflows while minimizing friction for end users."
    },
    {
      "label": "#3: Implementation",
      "text": "Products were categorized for intuitive browsing, and a dedicated 'Send Money' page guided users step by step. Checkout was designed to be smooth and transparent, with real-time inventory sync, secure payment processing, and a dropdown currency selector. Each currency triggered unique delivery options and dynamic exchange rates."
    },
    {
      "label": "#4: Testing & Launch",
      "text": "The team conducted thorough testing across browsers and devices to ensure the platform handled complex transactions reliably. Multilingual content was reviewed for clarity and consistency. After final approval, the platform launched successfully, delivering a unified shopping and remittance experience."
    }
  ],
  "outcome": "The launch of Pa Mi Gente created a bilingual e-commerce platform revolutionizing how families stay connected across borders. Customers can now seamlessly order fresh groceries and send money with flexible delivery options and real-time exchange rates—all from a secure, user-friendly interface.",
  "images": [
    "/images/case-studies/casestudy-details/pa-mi-gente-casestudy-2.webp",
    "/images/case-studies/casestudy-details/pa-mi-gente-casestudy-3.webp"
  ],
  "meta": {
    "industry": "Grocery & Food Retail",
    "technology": "Wordpress (WooCommerce)"
  }
}
