{
  "slug": "van-hunks",
  "title": "Van Hunks - Spicing Up Their Shopify Store",
  "mainImage": "/images/case-studies/casestudy-cards/van-hunks-casestudy.webp",
  "overview": "Van Hunks is a vibrant South African brand crafting sparkling wines that bring a sense of fun to everyday moments. Their existing Shopify store wasn’t capturing the energy or quality of their products. Customers weren’t staying on the site or converting into buyers. Van Hunks partnered with Codersh Web Services to transform their online store into a dynamic experience worthy of their bubbly wines.",
  "definedGoals": [
    "Revamp the Shopify store design to better reflect Van Hunks’ brand story and personality.",
    "Showcase products in an engaging, visually appealing way.",
    "Incorporate customer reviews and social proof to build trust and credibility.",
    "Enhance usability and navigation to reduce bounce rates and improve conversions.",
    "Integrate marketing tools like Klaviyo and Instagram to drive engagement.",
    "Ensure the website is easy for the Van Hunks team to maintain and update."
  ],
  "workflow": [
    {
      "label": "#1: Challenge",
      "text": "Van Hunks’ Shopify site lacked cohesion, visual appeal, and functional elements that help guide visitors toward making a purchase. Product presentation was weak, social proof was missing, and navigation felt scattered—resulting in low engagement and limited conversions."
    },
    {
      "label": "#2: Solution Design",
      "text": "The team set out to reimagine the home page, collection pages, and product pages to create a cohesive, inviting experience. We focused on consistent branding, interactive elements, and clear calls to action to keep visitors engaged."
    },
    {
      "label": "#3: Implementation",
      "text": "Key updates included a homepage hero slider with bold messaging, a logo carousel for trust, and dedicated sections for featured wines and customer testimonials. Collection pages were enhanced with video content, product grids, and social proof sections. Product pages were upgraded with image carousels, improved descriptions using Shopify meta fields, and cross-selling elements. We unified fonts, updated icons, and added an Instagram feed to keep content fresh."
    },
    {
      "label": "#4: Tech Integrations",
      "text": "We integrated Klaviyo for email marketing and reviews, and set up an Instagram app to display the latest posts. All components were connected seamlessly with Shopify to create a frictionless experience for both customers and store admins."
    },
    {
      "label": "#5: Testing & Launch",
      "text": "Extensive testing across devices and browsers ensured performance, design consistency, and smooth functionality before launch. The site went live with a fresh, modern look and a significantly improved user experience."
    }
  ],
  "outcome": "The redesigned Shopify store brought Van Hunks’ brand story to life and increased customer engagement. Visitors are spending more time on the site, interacting with new features, and making more purchases. The email list has grown steadily, and the improved design has helped Van Hunks stand out as a premium sparkling wine brand.",
  "images": [
    "/images/case-studies/casestudy-details/vanhunks-casestudy-2.webp",
    "/images/case-studies/casestudy-details/vanhunks-casestudy-3.webp"
  ],
  "meta": {
    "industry": "Wine Store (Sparkling Wines)",
    "technology": "Shopify"
  }
}
