{
  "id": "artisan-drink",
  "heroImage": "/images/brands/brands-details/artisan-1.webp",
  "brief": {
    "title": "The Brief",
    "description": "Artisan Drinks offers premium mixers, including tonics, ginger mixers, and craft sodas, designed to elevate cocktail experiences. Committed to quality and innovation, their products cater to diverse tastes and preferences. The company collaborates with craft spirit brands to inspire customers with cocktail recipes and serving ideas. Enjoy a seamless shopping experience with free delivery on orders over £20. Dedicated to sustainability, Artisan Drinks ensures eco-conscious practices in every product."
  },
  "details": {
    "industry": "Beverages Industry | Soft Drinks Manufacturing",
    "project": "(DTC) Ecommerce Platform | Product Development and Marketing | Web Design & Development",
    "technology": "Shopify Development | E-Commerce & Payments Integration | Cloudflare & Google CDN | Klaviyo Marketing Automation & Review",
    "visit": "https://artisandrinks.com/"
  },
  "images": {
    "laptop": "/images/brands/brands-details/artisan-2.webp",
    "other": [
      "/images/brands/brands-details/artisan-3.webp",
      "/images/brands/brands-details/artisan-4.webp"
    ]
  },
  "challenge": {
    "title": "Challenge",
    "description": "Artisan Drinks faces challenges in data collection and analysis, hindering the ability to measure the impact of sustainability initiatives and identify effective strategies. Implementing robust tracking systems would help align efforts with long-term goals and demonstrate progress to stakeholders. The website also faces issues with site navigation, particularly due to its diverse product range. Simplifying the layout and adding intuitive filters could enhance user experience. Mobile optimization is crucial, as many customers shop via smartphones. Improving product descriptions with details on ingredients, sourcing, and pairing suggestions could engage customers more. Lastly, clearer shipping and delivery information, including costs and timelines, would improve transparency, especially during peak seasons."
  },
  "solution": {
    "title": "Solution & Results",
    "description": "To address its challenges, Artisan Drinks can enhance site navigation by simplifying the menu and adding robust search functionality with filters. Optimizing the mobile experience through responsive design and mobile-friendly features will ensure seamless browsing and purchasing. Product information can be improved with detailed descriptions, ingredient lists, sourcing info, and cocktail pairing suggestions, supported by high-quality imagery. Visual consistency should be maintained with unified design elements and balanced layouts. Shipping and logistics can be clarified with transparent policies and real-time order tracking. For data collection, implementing analytics tools and conducting regular reviews will help measure progress and refine strategies. These solutions will improve user experience, streamline operations, and drive business growth."
  },
  "relatedBrands": [
    {
    "id": 3,
    "title": "liberation-cocktails",
    "img": "/images/brands/brands-cards/11.webp",
    "link": "/brand/liberation-cocktails"
  },
  {
    "id": 2,
    "title": "elevation-107",
    "img": "/images/brands/brands-cards/3.webp",
    "link": "/brand/elevation-107"
  },
  {
    "id": 1,
    "title": "kick-ash-basket",
    "img": "/images/brands/brands-cards/4.webp",
    "link": "/brand/kick-ash-basket"
  }
  ]
}
