{
  "id": "bone-idyll",
  "heroImage": "/images/brands/brands-details/boneidyl-1.webp",
  "brief": {
    "title": "The Brief",
    "description": "Bone Idyll is an urban distillery and bar in Kingston, London, specializing in small-batch spirits and cocktails. The website offers a range of premium products, including gin, rum, and vodka, along with bottled and canned cocktails. It provides an immersive experience, allowing visitors to explore the distilling process through its gin school and distillery tours. Bone Idyll emphasizes craftsmanship and quality in every product. The site also features exclusive gifts and merchandise, providing customers with unique and high-quality options for both personal enjoyment and special occasions. It's a destination for cocktail enthusiasts seeking premium, locally crafted spirits."
  },
  "details": {
    "industry": "Beverage | Alcoholic Drinks",
    "project": "(DTC) Ecommerce Platform Development | Product Branding & Marketing | Brand Experience Website",
    "technology": "Shopify E-Commerce Development | ReactJs & Bootstrap Framework | Cloudflare Web Hosting & CDN | MailChimp Marketing & Mail-Automation",
    "visit": "https://www.boneidyll.co.uk/"
  },
  "images": {
    "laptop": "/images/brands/brands-details/boneidyl-2.webp",
    "other": [
      "/images/brands/brands-details/boneidyl-3.webp",
      "/images/brands/brands-details/boneidyl-4.webp"
    ]
  },
  "challenge": {
    "title": "Challenge",
    "description": "The Bone Idyll website faces several challenges. Ensuring a seamless user experience is key, given the variety of products and experiences offered. Complex navigation or unclear descriptions could lead to frustration. Shipping logistics are also a concern, especially with fragile or perishable items like bottled spirits, requiring careful handling and timely delivery. The site must maintain regulatory compliance for alcohol sales, including age verification and regional shipping restrictions. Additionally, to stand out in the competitive artisanal spirits market, brand differentiation and effective digital marketing strategies are essential for attracting and retaining customers."
  },
  "solution": {
    "title": "Solution & Results",
    "description": "To address these challenges, our team can enhance user experience by simplifying navigation, improving product descriptions, and adding user-friendly filters. For shipping logistics, they can collaborate with specialized couriers to ensure safe and timely deliveries of fragile, perishable items. To ensure regulatory compliance, integrating age verification systems and updating shipping policies will help meet legal requirements. In a competitive market, Bone Idyll can invest in targeted digital marketing strategies and compelling brand storytelling to increase visibility, differentiate the brand, and foster greater customer engagement. These solutions will improve user satisfaction and overall site performance."
  },
  "relatedBrands": [
   {
    "id": 3,
    "title": "liberation-cocktails",
    "img": "/images/brands/brands-cards/11.webp",
    "link": "/brand/liberation-cocktails"
  },
  {
    "id": 2,
    "title": "elevation-107",
    "img": "/images/brands/brands-cards/3.webp",
    "link": "/brand/elevation-107"
  },
  {
    "id": 1,
    "title": "kick-ash-basket",
    "img": "/images/brands/brands-cards/4.webp",
    "link": "/brand/kick-ash-basket"
  }
  ]
}
