{
  "id": "splitgrip",
  "heroImage": "/images/brands/brands-details/splitgrip-1.webp",
  "brief": {
    "title": "The Brief",
    "description": "The Split Grip Trainer is a patent-pending tool designed to refine swing mechanics and enhance player performance. With three training modes—split grip, short bat, and one-hand—it helps athletes build strength, control, and efficiency, making it an essential aid for improving batting technique. Founded by former professional players Cory Voss and Trevor Goldberg, the Split Grip Trainer combines their deep expertise in baseball and bat crafting. Cory, a Division 1 All-American and former draft pick, owns The Baseball Mill in Pueblo, Colorado, while Trevor, a former collegiate player, has been crafting custom wood bats with Berg Bat Company since he was 15. Together, they created the Split Grip Trainer to elevate training and player performance across all skill levels."
  },
  "details": {
    "industry": "Sports Equipment | Custom Craftsmanship",
    "project": "Brand Design / Development | Web Design & Development | Manufacturing | Custom Product Design",
    "technology": "Shopify Development | E-Commerce & Payments Integration | Bootstrap UI Framework",
    "visit": "https://splitgrip.com/"
  },
  "images": {
    "laptop": "/images/brands/brands-details/splitgrip-2.webp",
    "other": [
      "/images/brands/brands-details/splitgrip-3.webp",
      "/images/brands/brands-details/splitgrip-4.webp"
    ]
  },
  "challenge": {
    "title": "Challenge",
    "description": "SplitGrip.com struggled with low user engagement and high cart abandonment rates, primarily due to a website structure that was difficult to navigate and an outdated design. The site’s user experience did not align with the premium brand image that SplitGrip aimed to project. As a result, customers found it hard to easily explore products, leading to frustration and lost sales. Additionally, the design lacked the modern, polished look needed to attract and retain customers. These issues hindered the company’s ability to fully capitalize on its innovative products and premium positioning in the market."
  },
  "solution": {
    "title": "Solution & Results",
    "description": "The team revamped SplitGrip’s WordPress WooCommerce store, prioritizing a user-friendly design with intuitive navigation. High-quality product images and strategically placed call-to-action buttons were integrated to drive conversions. These improvements led to notable results, including a 40% increase in average session duration, a 35% drop in cart abandonment, and a 70% growth in revenue within just three months. The redesigned store not only enhanced the overall shopping experience but also aligned with the premium brand image, resulting in higher customer satisfaction and a significant boost in sales performance."
  },
  "relatedBrands": [
    {
      "id": 3,
      "title": "Brand 3",
      "img": "/images/brands/brands-cards/11.webp",
      "link": "/brand3"
    },
    {
      "id": 2,
      "title": "Brand 2",
      "img": "/images/brands/brands-cards/3.webp",
      "link": "/brand2"
    },
    {
      "id": 1,
      "title": "Brand 1",
      "img": "/images/brands/brands-cards/4.webp",
      "link": "/brand1"
    }
  ]
}
